tap "felixkratz/formulae"
tap "nikitabobko/tap"
brew "cocoapods"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "imagemagick"
brew "jq"
brew "neovim"
brew "poppler"
brew "powerlevel10k"
brew "resvg"
brew "ripgrep"
brew "rust-analyzer"
brew "sevenzip"
brew "shfmt"
brew "tmux"
brew "watchman"
brew "yazi"
brew "zoxide"
brew "zsh-syntax-highlighting"
brew "felixkratz/formulae/sketchybar"
cask "aerospace"
cask "font-hack-nerd-font"
cask "font-sketchybar-app-font"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "ngrok"
vscode "aaron-bond.better-comments"
vscode "anthropic.claude-code"
vscode "astro-build.astro-vscode"
vscode "asvetliakov.vscode-neovim"
vscode "catppuccin.catppuccin-vsc"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mkhl.shfmt"
vscode "ms-azuretools.vscode-containers"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "prisma.prisma"
go "github.com/air-verse/air"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/haya14busa/goplay/cmd/goplay"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "github.com/josharian/impl"
go "honnef.co/go/tools/cmd/staticcheck"
